Add_pet_types-Combined-JMeter-and-Selenium.yml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Add pet types-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Add pet types-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Add pet types-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1440,789)
      - go(https://client.sana-commerce.dev/petclinic/welcome)
      - 'clickByshadow(app-root, li:nth-of-type(3) > a:nth-of-type(1))'
      - 'clickByshadow(app-root, li:nth-of-type(3) > ul:nth-of-type(1) > li:nth-of-type(1) > a:nth-of-type(1))'
      - 'clickByshadow(app-root, app-vet-list, div:nth-of-type(1) > button:nth-of-type(2))'
      - clickByshadow(app-root, app-vet-add, input[name="firstName"])
      - typeByshadow(app-root, app-vet-add, input[name="firstName"]): "sdf"
      - clickByshadow(app-root, app-vet-add, input[name="lastName"])
      - typeByshadow(app-root, app-vet-add, input[name="lastName"]): "xcv"
      - clickByshadow(app-root, app-vet-add, select)
      - selectByshadow(app-root, app-vet-add, select): "new"
      - clickByshadow(app-root, app-vet-add, button[type="submit"])

  Add pet types-Http:
    headers:
      sec-ch-ua: '" Not A;Brand";v="99", "Chromium";v="102", "Google Chrome";v="102"'
      Accept: 'application/json, text/plain, */*'
      sec-ch-ua-mobile: '?0'
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/102.0.5005.61 Safari/537.36'
      sec-ch-ua-platform: '"macOS"'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://rest.sana-commerce.dev/petclinic/api/vets'
            method: GET
            label: 'https://rest.sana-commerce.dev/petclinic/api/vets'
            headers: {}
          - url: 'https://rest.sana-commerce.dev/petclinic/api/specialties'
            method: GET
            label: 'https://rest.sana-commerce.dev/petclinic/api/specialties'
            headers: {}
          - url: 'https://rest.sana-commerce.dev/petclinic/api/vets'
            method: POST
            label: 'https://rest.sana-commerce.dev/petclinic/api/vets'
            headers:
              Content-Type: application/json
            body: '{"id":null,"firstName":"sdf","lastName":"xcv","specialties":[{"id":45,"name":"new"}]}'
          - url: 'https://rest.sana-commerce.dev/petclinic/api/vets'
            method: GET
            label: 'https://rest.sana-commerce.dev/petclinic/api/vets'
            headers: {}